{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.3", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_2_input"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "batch_input_shape": [null, 256], "dtype": "float32", "units": 16384, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [4, 4, 1024]}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_5", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_6", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_12", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_7", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_13", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_8", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_14", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_9", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "batch_normalization_5/gamma", "shape": [16384], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.36631330847740173, "scale": 0.006501846336850933, "original_dtype": "float32"}}, {"name": "batch_normalization_5/beta", "shape": [16384], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7476269843531589, "scale": 0.006029249873815798, "original_dtype": "float32"}}, {"name": "batch_normalization_5/moving_mean", "shape": [16384], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.010681436437309958, "scale": 8.410579871897604e-05, "original_dtype": "float32"}}, {"name": "batch_normalization_5/moving_variance", "shape": [16384], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.24890778958797455, "scale": 0.0005740970373153687, "original_dtype": "float32"}}, {"name": "batch_normalization_6/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.641209602355957, "scale": 0.0032013865078196805, "original_dtype": "float32"}}, {"name": "batch_normalization_6/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8161405920982361, "scale": 0.0030368332623266704, "original_dtype": "float32"}}, {"name": "batch_normalization_6/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -10.385921837301815, "scale": 0.05583828944785922, "original_dtype": "float32"}}, {"name": "batch_normalization_6/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 70.8909912109375, "scale": 0.5006555893841912, "original_dtype": "float32"}}, {"name": "batch_normalization_7/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.6524878144264221, "scale": 0.0034931493740455776, "original_dtype": "float32"}}, {"name": "batch_normalization_7/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7521535210749682, "scale": 0.0037420573187809366, "original_dtype": "float32"}}, {"name": "batch_normalization_7/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.3325513189914178, "scale": 0.01995539711970909, "original_dtype": "float32"}}, {"name": "batch_normalization_7/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 11.137977600097656, "scale": 0.1768264321719899, "original_dtype": "float32"}}, {"name": "batch_normalization_8/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5909387469291687, "scale": 0.0037674695837731456, "original_dtype": "float32"}}, {"name": "batch_normalization_8/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8505490401211908, "scale": 0.003937727037598105, "original_dtype": "float32"}}, {"name": "batch_normalization_8/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.922590377751519, "scale": 0.018381071558185653, "original_dtype": "float32"}}, {"name": "batch_normalization_8/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 2.24360728263855, "scale": 0.13943642728468952, "original_dtype": "float32"}}, {"name": "batch_normalization_9/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.8347865343093872, "scale": 0.0024162203657860848, "original_dtype": "float32"}}, {"name": "batch_normalization_9/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2479589187047061, "scale": 0.001836732731145971, "original_dtype": "float32"}}, {"name": "batch_normalization_9/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3619161484288234, "scale": 0.004360435523238836, "original_dtype": "float32"}}, {"name": "batch_normalization_9/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.8815596103668213, "scale": 0.05910493345821605, "original_dtype": "float32"}}, {"name": "conv2d_transpose_5/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5437185483820298, "scale": 0.004456709412967458, "original_dtype": "float32"}}, {"name": "conv2d_transpose_6/kernel", "shape": [4, 4, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7129624441558239, "scale": 0.0065409398546405866, "original_dtype": "float32"}}, {"name": "conv2d_transpose_7/kernel", "shape": [4, 4, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.969397871167052, "scale": 0.006294791371214623, "original_dtype": "float32"}}, {"name": "conv2d_transpose_8/kernel", "shape": [4, 4, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5057962747181163, "scale": 0.004817107378267774, "original_dtype": "float32"}}, {"name": "conv2d_transpose_9/kernel", "shape": [4, 4, 3, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2862174003731971, "scale": 0.0027001641544641235, "original_dtype": "float32"}}, {"name": "dense_2/kernel", "shape": [256, 16384], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16383694503821578, "scale": 0.0013212656857920627, "original_dtype": "float32"}}]}]}