{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.3", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_2_input"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "batch_input_shape": [null, 256], "dtype": "float32", "units": 16384, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [4, 4, 1024]}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_4", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_5", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_6", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_7", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [16384], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.4838137924671173, "scale": 0.005741874727548338, "original_dtype": "float32"}}, {"name": "batch_normalization_4/beta", "shape": [16384], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7827219133283578, "scale": 0.006261775306626863, "original_dtype": "float32"}}, {"name": "batch_normalization_4/moving_mean", "shape": [16384], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.013864963030552162, "scale": 0.0001074803335701718, "original_dtype": "float32"}}, {"name": "batch_normalization_4/moving_variance", "shape": [16384], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.24566686153411865, "scale": 0.00033129044607573867, "original_dtype": "float32"}}, {"name": "batch_normalization_5/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.69215327501297, "scale": 0.0033496877726386575, "original_dtype": "float32"}}, {"name": "batch_normalization_5/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.940301775932312, "scale": 0.0033719478576791054, "original_dtype": "float32"}}, {"name": "batch_normalization_5/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -10.223931523865344, "scale": 0.06512058295455633, "original_dtype": "float32"}}, {"name": "batch_normalization_5/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 40.038482666015625, "scale": 0.3873443603515625, "original_dtype": "float32"}}, {"name": "batch_normalization_6/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.4280276298522949, "scale": 0.00428462729734533, "original_dtype": "float32"}}, {"name": "batch_normalization_6/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9417927861213685, "scale": 0.004616631304516512, "original_dtype": "float32"}}, {"name": "batch_normalization_6/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.679180437443303, "scale": 0.02102388821396173, "original_dtype": "float32"}}, {"name": "batch_normalization_6/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 5.421030044555664, "scale": 0.25416839450013406, "original_dtype": "float32"}}, {"name": "batch_normalization_7/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.7280821800231934, "scale": 0.003123781727809532, "original_dtype": "float32"}}, {"name": "batch_normalization_7/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.30135057813981003, "scale": 0.002183699841592826, "original_dtype": "float32"}}, {"name": "batch_normalization_7/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4188577878708933, "scale": 0.006755770772111182, "original_dtype": "float32"}}, {"name": "batch_normalization_7/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 9.691842079162598, "scale": 0.12416254305372051, "original_dtype": "float32"}}, {"name": "conv2d_transpose_4/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6403344350702622, "scale": 0.005292020124547622, "original_dtype": "float32"}}, {"name": "conv2d_transpose_5/kernel", "shape": [4, 4, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8493403357617996, "scale": 0.00725931910907521, "original_dtype": "float32"}}, {"name": "conv2d_transpose_6/kernel", "shape": [4, 4, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7571909362194584, "scale": 0.006946705836875766, "original_dtype": "float32"}}, {"name": "conv2d_transpose_7/kernel", "shape": [4, 4, 3, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3287481167737175, "scale": 0.00373577405424679, "original_dtype": "float32"}}, {"name": "dense_2/kernel", "shape": [256, 16384], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1918485403060913, "scale": 0.0013902068138122558, "original_dtype": "float32"}}]}]}